Terraform Plan:
```aws_route53_zone.apse2-name: Refreshing state... [id=Z09894843QG7J1MO45IQ0]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_ebs_volume.gp3_volume_wazuh-indexer: Refreshing state... [id=vol-0fef670bbba91e14b]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_acm_certificate.apse2_wildcard_cert: Refreshing state... [id=arn:aws:acm:us-east-1:941133421128:certificate/e644724a-c055-4c6d-8d92-29b35864782d]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_ebs_volume.gp3_volume_graylog: Refreshing state... [id=vol-09fadedb2984d0b19]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240126004538591100000001]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240126004538603800000002]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_route53_record.apse2_wildcard_cert_validation["*.apse2.com"]: Refreshing state... [id=Z09894843QG7J1MO45IQ0__56fe1587127b82a6f67c538939a3fe76.apse2.com._CNAME]
aws_acm_certificate_validation.apse2_wildcard_cert_validation: Refreshing state... [id=2024-01-27 09:27:41.107 +0000 UTC]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/421165a951a7c27a]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_lb_target_group.graylog_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e6751c2334752c2f]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/soc-alb/894bb79551ab6cb7]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
module.ec2_wazuh-indexer-01.aws_instance.this[0]: Refreshing state... [id=i-020ee2d56341b4bd9]
module.ec2_graylog.aws_instance.this[0]: Refreshing state... [id=i-0475a87153340e1aa]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_route53_record.prometheus_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_prometheus.apse2.com_A]
aws_route53_record.grafana_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_grafana.apse2.com_A]
aws_route53_record.wazuh_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_wazuh.apse2.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5]
aws_route53_record.graylog_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_graylog.apse2.com_A]
aws_lb_listener_rule.graylog_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/4e212c0b059835e1]
aws_lb_listener_rule.grafana_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/74594ec4917e91c4]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/964322617c2f1803]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e-20240127050235591300000001]
aws_volume_attachment.ebs_att_wazuh-indexer-01: Refreshing state... [id=vai-2087835945]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/421165a951a7c27a-20240127110741764600000001]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]
aws_volume_attachment.ebs_att_graylog: Refreshing state... [id=vai-2483848253]
aws_lb_target_group_attachment.graylog_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e6751c2334752c2f-20240129065846390700000001]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener_rule.wazuh_agent_subdomain will be created
  + resource "aws_lb_listener_rule" "wazuh_agent_subdomain" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5"
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "agents.apse2.com",
                ]
            }
        }
    }

  # aws_lb_target_group.wazuh_agent_tg will be created
  + resource "aws_lb_target_group" "wazuh_agent_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "wazuh-agent-tg"
      + name_prefix                        = (known after apply)
      + port                               = 1515
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-03e05ec4d7ef91467"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.wazuh_agent_attachment will be created
  + resource "aws_lb_target_group_attachment" "wazuh_agent_attachment" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = "i-020ee2d56341b4bd9"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```